// тут можна писати js код

// однорядковий коментар
/* 
  багаторядковий 
  коментар
*/

// тип даних String
'приклад тексту';
"приклад тексту";
`приклад тексту`;

// тип даних Number
10;
-50;
7.23;
0;

// тип даних Bigint
12300000000000000000000000000000000000000000000000000000n;

// тип даних Boolean
true;
false;

// тип даних null (пусте значення)
null;

// тип даних undefined (відсутність значення)
undefined;

// тип даних Symbol
// new Symbol('приклад символу')

// функція
// alert('some information');
// console.log(3465);
// console.log('blablabla');

// змінні
// створення пустої змінної (оголошення змінної)
let age;

// встановлення/присвоєння значення змінної
age = 15;
console.log(age);

// ініціалізація змінної (оголошення + присвоєння одразу)
let otherUserAge = 5;
console.log(otherUserAge);

// помилка - неможна перестворити існуючу змінну
// помилка - const обов'язково має бути проініціалізований
// помилка - немаожна звертатися до змінної перед її створенням
// помилка - перезапис константи (const)

